//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>

//int main()
//{
//	//&取地址符操作
//	int a = 10;
//	printf("%p\n", &a);
//	int *pa = &a;//pa用来存放地址-pa是一个指针变量
//	*pa=20;//*解引用操作符  --- 间接访问操作符
//	printf("%d\n", a);
//	return 0;
//}


//关系操作符   >	>=	<	<=	!=	==

//逻辑操作符	判断真假:&&两个同时为真才为真 ，||有一个为真则为真		区分按位与跟逻辑与~~~   在运算中&&前面为假后面就不用算了

//条件操作符	三目操作符
//int main()
//{
//	int a = 3;
//	int b = 0;
//	b = (a > 5 ? 1 : -1);
//  printf("%d",b);
//	return 0;
//}

//逗号表达式		从左向右，整个表达式结果是最后一个
		